<a href="https://colab.research.google.com/github/abequette/CS167Fall22Code/blob/main/Day03_exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

An example of a markdown cell<br>
Author: <b>Alec Bequette</b><br>
Date: Sepetmber 6, 2022
# Python and Pandas Exercises

Before you begin, make sure you download the data from Blackboard and put it in your Google Drive where you know how to find it (preferably in a datasets folder).

## Part 1: Selecting columns in dataframes

In [2]:
#selecting columns in dataframes
import pandas
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pandas.read_csv('/content/drive/MyDrive/CS167/titanic.csv')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# what is the data type of titanic?

In [ ]:
type(titanic)

pandas.core.frame.DataFrame

Data frame

In [ ]:
# what are the features (column titles) of the titanic dataset?

survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone

In [ ]:
# display only the 'embark_town' column of the titanic data

In [ ]:
titanic['embark_town']

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [ ]:
# what is the data type of the result of the previous cell?

In [ ]:
type(titanic['embark_town'])

pandas.core.series.Series

Series

In [ ]:
# what is the "shape" of the data frame?

In [ ]:
titanic.shape

(891, 15)

The shape is (891, 15)

In [ ]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows

In [ ]:
subset = titanic[['sex', 'embarked', 'alive']]
subset.loc[871:]

        sex embarked alive
871  female        S   yes
872    male        S    no
873    male        S    no
874  female        C   yes
875  female        C   yes
876    male        S    no
877    male        S    no
878    male        S    no
879  female        C   yes
880  female        S   yes
881    male        S    no
882  female        S    no
883    male        S    no
884    male        S    no
885  female        Q    no
886    male        S    no
887  female        S   yes
888  female        S    no
889    male        C   yes
890    male        Q    no

In [ ]:
# make a subset that consists of the last 20 rows of the data and the columns: survived, pclass, sex, and age

In [ ]:
subset = titanic[['survived', 'pclass', 'sex', 'age']]
subset.loc[871:]

     survived  pclass     sex   age
871         1       1  female  47.0
872         0       1    male  33.0
873         0       3    male  47.0
874         1       2  female  28.0
875         1       3  female  15.0
876         0       3    male  20.0
877         0       3    male  19.0
878         0       3    male   NaN
879         1       1  female  56.0
880         1       2  female  25.0
881         0       3    male  33.0
882         0       3  female  22.0
883         0       2    male  28.0
884         0       3    male  25.0
885         0       3  female  39.0
886         0       2    male  27.0
887         1       1  female  19.0
888         0       3  female   NaN
889         1       1    male  26.0
890         0       3    male  32.0

## Part 2: Selecting rows: loc vs iloc

In [ ]:
# use loc to print out the data for passenger 890 on the titanic dataframe
# use iloc to print out the data for passenger 890 on the subset dataframe

In [ ]:
print(titanic.loc[890])
print()
print(subset.iloc[20])

survived                0
pclass                  3
sex                  male
age                  32.0
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

survived       0
pclass         2
sex         male
age         35.0
Name: 20, dtype: object

In [ ]:
# use a markdown (text) cell; describe the difference between loc and iloc

Loc chooses the row based on the position in the entire dataset. Iloc chooses the row based on the rows in the subset.

## Part 3: Subsetting using series

In [ ]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function

In [ ]:
queenstown_subset = titanic[titanic['embark_town'] == 'Queenstown']
queenstown_subset

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
32,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
790,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
825,0,3,male,NaN,0,0,6.9500,Q,Third,man,True,NaN,Queenstown,no,True
828,1,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,yes,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# how many passengers are in queenstown_subset?

There are 77 rows, so there are 77 passengers.

## Part 4: Some Handy Functions

In [ ]:
# what is the average fare for all of those in the queenstown_subset?

In [ ]:
queenstown_subset['fare'].mean()

13.276029870129872

In [ ]:
# what is the average age for all of those in the queenstown_subset?
# do all of the passengers have an age recorded? What is recorded if there is no age?

In [ ]:
queenstown_subset['age'].mean()

28.089285714285715

The passengers who have no age recorded are labeled as NaN (Not a Number).

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

unique() finds all the possible values for a column.
mean() finds the average of all numerical values in a column.
isnull() finds if a cell has a value or not.
fillna() allows the user to replace null values with something whatever the user places in the ().

In [ ]:
# give examples of your use of unique(), mean(), median(), isnull()

In [ ]:
queenstown_subset['fare'].mean()

13.276029870129872

In [3]:
# load in the iris data
# what is the median sepal width of just the Setosas?
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
iris_data = pandas.read_csv('/content/drive/MyDrive/CS167/irisData.csv')
iris_data

     sepal length  sepal width  petal length  petal width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [6]:
iris_data['petal width'].mean()

1.1986666666666668

In [ ]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?